       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "HOLA es 100".
           STOP RUN.